In [1]:
# Importando a biblioteca
import pandas as pd

In [2]:
# Leitura dos arquivos
df1 = pd.read_excel("Datasets/Aracaju.xlsx")
df2 = pd.read_excel("Datasets/Fortaleza.xlsx")
df3 = pd.read_excel("Datasets/Natal.xlsx")
df4 = pd.read_excel("Datasets/Recife.xlsx")
df5 = pd.read_excel("Datasets/Salvador.xlsx")

In [3]:
# Juntando todos os arquivos
df = pd.concat([df1, df2, df3, df4, df5])

In [4]:
# Exibindo as 5 primeiras linhas
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [5]:
# Exibindo as 5 últimas
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [9]:
df.sample(5)

        Cidade       Data  Vendas  LojaID  Qtde
18     Aracaju 2018-01-01   32.14    1522     6
222      Natal 2019-01-02   43.96    1037     1
7        Natal 2019-03-18  886.00     853     4
107  Fortaleza 2019-01-01   21.90    1004     6
8     Salvador 2019-02-11    4.96    1036     2

In [8]:
# Verificando  o tipo de dados de cada coluna
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [10]:
# Alterando o tipo de dado da coluna LojaID
df["LojaID"] = df["LojaID"].astype("object")

In [11]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [12]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde
0  Aracaju 2018-01-01  142.00   1520     1
1  Aracaju 2018-01-01   14.21   1522     6
2  Aracaju 2018-01-01   71.55   1520     1
3  Aracaju 2018-01-01    3.01   1521     7
4  Aracaju 2018-01-01   24.51   1522     8

## Trantando valores Faltantes

In [13]:
# Consultando linhas com valores faltantes
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [14]:
# Substituindo os valores nulos pela média
df["Vendas"].fillna(df["Vendas"].mean(), inplace = True)

In [15]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [19]:
df.sample(15)

        Cidade       Data  Vendas LojaID  Qtde
219   Salvador 2019-01-02   19.67   1037     2
18   Fortaleza 2019-01-01   38.31   1002     3
32      Recife 2019-01-01   15.93    982     7
76   Fortaleza 2019-01-01   38.61   1004     4
13      Recife 2019-02-12   15.33    983     5
32    Salvador 2019-01-01  151.27   1035     1
90    Salvador 2019-01-01  100.54   1036     2
199   Salvador 2019-01-02  153.87   1036     3
192   Salvador 2019-01-02  166.51   1036     1
63   Fortaleza 2019-01-01  118.17   1004     1
64     Aracaju 2018-01-01   21.00   1523     5
15     Aracaju 2018-01-01  153.28   1523     6
44     Aracaju 2018-01-01   11.42   1520     5
88       Natal 2019-01-02   31.20   1036     1
103   Salvador 2019-01-01  191.60   1034     1

In [16]:
# Substituindo os valores nulos por zero
df["Vendas"].fillna(0, inplace = True)

In [20]:
df["Vendas"].mean()

122.61180089485438

In [17]:
# Apagando as linhas com valores nulos
df.dropna(inplace= True)

In [21]:
# Apagando as linhas com valores nulos com base apenas em 1 coluna
df.dropna(subset=["Vendas"], inplace=True)

In [23]:
# Removendo linhas que estejam com valores faltantes em todas as colunas
df.dropna(how="all", inplace = True)

## Criando colunas novas

In [25]:
# Criando a coluna de receita
df["Receita"] = df["Vendas"].mul(df["Qtde"])

In [26]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00   1520     1   142.00
1  Aracaju 2018-01-01   14.21   1522     6    85.26
2  Aracaju 2018-01-01   71.55   1520     1    71.55
3  Aracaju 2018-01-01    3.01   1521     7    21.07
4  Aracaju 2018-01-01   24.51   1522     8   196.08

In [27]:
df["Receita/Vendas"] = df["Receita"] / df["Vendas"]

In [28]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
0  Aracaju 2018-01-01  142.00   1520     1   142.00             1.0
1  Aracaju 2018-01-01   14.21   1522     6    85.26             6.0
2  Aracaju 2018-01-01   71.55   1520     1    71.55             1.0
3  Aracaju 2018-01-01    3.01   1521     7    21.07             7.0
4  Aracaju 2018-01-01   24.51   1522     8   196.08             8.0

In [29]:
#Retornando a maior receita
df["Receita"].max()

3544.0

In [30]:
# retornando a menor receita
df["Receita"].min()

3.34

In [35]:
#nlargest
df.nlargest(3,"Receita")

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0

In [36]:
#nsmallest
df.nsmallest(3,"Receita")

      Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
118  Aracaju 2018-01-01    3.34   1522     1     3.34             1.0
65    Recife 2019-01-01    4.01    981     1     4.01             1.0
92     Natal 2019-01-02    4.57   1035     1     4.57             1.0

In [37]:
# Agrupamento por cidade
df.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [38]:
# Ordenando o conjunto de dados
df.sort_values("Receita", ascending=False).head(10)

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
30  Natal 2018-10-02   856.0    853     4   3424.0             4.0
41  Natal 2018-05-20   835.0    852     4   3340.0             4.0
38  Natal 2018-02-25   828.0    852     4   3312.0             4.0
10  Natal 2018-10-27   828.0    852     4   3312.0             4.0
69  Natal 2019-03-24   817.0    852     4   3268.0             4.0
62  Natal 2018-02-10   793.0    854     4   3172.0             4.0
52  Natal 2018-04-27   778.0    854     4   3112.0             4.0

## Trabalhando com Datas

In [41]:
# Transformando a coluna de dado em tipo inteiro
df["Data"] = df["Data"].astype("int64")

In [42]:
# Verificando o tipo de dado de cada coluna
df.dtypes

Cidade             object
Data                int64
Vendas            float64
LojaID             object
Qtde                int64
Receita           float64
Receita/Vendas    float64
dtype: object

In [43]:
# Transformando coluna de dada em data
df["Data"] = pd.to_datetime(df["Data"])

In [44]:
df.dtypes

Cidade                    object
Data              datetime64[ns]
Vendas                   float64
LojaID                    object
Qtde                       int64
Receita                  float64
Receita/Vendas           float64
dtype: object

In [45]:
# Agrupamento por Ano
df.groupby(df["Data"].dt.year)["Receita"].sum()

Data
2018    118176.53
2019    228246.45
Name: Receita, dtype: float64

In [46]:
# Criando uma nova coluna com o ano
df["Ano_Venda"] = df["Data"].dt.year

In [47]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda
62,Natal,2018-02-10,793.00,854,4,3172.00,4.0,2018
10,Recife,2019-01-01,38.51,982,8,308.08,8.0,2019
26,Natal,2018-07-20,370.00,853,3,1110.00,3.0,2018
202,Natal,2019-01-02,22.45,1036,1,22.45,1.0,2019
20,Salvador,2019-01-01,33.97,1034,3,101.91,3.0,2019

In [48]:
# Extraindo o mês e o dia
df["mes_venda"], df["dia_venda"] = (df["Data"].dt.month, df["Data"].dt.day)

In [49]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda,mes_venda,dia_venda
103,Salvador,2019-01-01,191.60,1034,1,191.60,1.0,2019,1,1
121,Natal,2019-01-02,100.70,1037,3,302.10,3.0,2019,1,2
57,Aracaju,2018-01-01,23.49,1520,7,164.43,7.0,2018,1,1
133,Natal,2019-01-02,153.71,1035,1,153.71,1.0,2019,1,2
58,Aracaju,2018-01-01,37.14,1520,7,259.98,7.0,2018,1,1

In [50]:
# Retornando a data mais antiga
df["Data"].min()

Timestamp('2018-01-01 00:00:00')

In [52]:
# Calculando a diferença e dias
df["diferenca_dias"] = df["Data"] - df["Data"].min()

In [53]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda,mes_venda,dia_venda,diferenca_dias
217,Salvador,2019-01-02,37.65,1036,2,75.30,2.0,2019,1,2,366 days
7,Fortaleza,2019-02-11,35.50,1003,2,71.00,2.0,2019,2,11,406 days
82,Salvador,2019-01-01,207.88,1035,1,207.88,1.0,2019,1,1,365 days
103,Recife,2019-01-01,41.65,982,3,124.95,3.0,2019,1,1,365 days
46,Recife,2019-01-01,239.17,981,8,1913.36,8.0,2019,1,1,365 days

In [54]:
# Criando a coluna de trimestre
df["trimestre_venda"] = df["Data"].dt.quarter

In [55]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda,mes_venda,dia_venda,diferenca_dias,trimestre_venda
137,Fortaleza,2019-03-02,51.99,983,3,155.97,3.0,2019,3,2,425 days,1
71,Natal,2019-03-20,840.00,854,3,2520.00,3.0,2019,3,20,443 days,1
66,Recife,2019-01-01,14.59,983,7,102.13,7.0,2019,1,1,365 days,1
223,Salvador,2019-01-02,40.51,1037,2,81.02,2.0,2019,1,2,366 days,1
52,Aracaju,2018-01-01,14.76,1520,3,44.28,3.0,2018,1,1,0 days,1

In [60]:
# filtrando as vendas de 2019 do mês de março
vendas_marco_19 = df.loc[(df["Data"].dt.year == 2019) & (df["Data"].dt.month == 3)]

In [62]:
 vendas_marco_19.sample(20)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda,mes_venda,dia_venda,diferenca_dias,trimestre_venda
123,Fortaleza,2019-03-02,20.22,981,6,121.32,6.0,2019,3,2,425 days,1
141,Fortaleza,2019-03-02,182.75,983,8,1462.00,8.0,2019,3,2,425 days,1
32,Natal,2019-03-17,244.00,854,2,488.00,2.0,2019,3,17,440 days,1
4,Natal,2019-03-09,699.00,853,3,2097.00,3.0,2019,3,9,432 days,1
118,Salvador,2019-03-02,92.21,1035,2,184.42,2.0,2019,3,2,425 days,1
117,Recife,2019-03-02,15.42,983,8,123.36,8.0,2019,3,2,425 days,1
131,Recife,2019-03-02,139.07,982,6,834.42,6.0,2019,3,2,425 days,1
126,Fortaleza,2019-03-02,41.87,980,8,334.96,8.0,2019,3,2,425 days,1
136,Fortaleza,2019-03-02,39.09,982,4,156.36,4.0,2019,3,2,425 days,1
122,Fortaleza,2019-03-02,235.06,983,3,705.18,3.0,2019,3,2,425 days,1
120,Recife,2019-03-02,184.90,982,4,739.60,4.0,2019,3,2,425 days,1
120,Fortaleza,2019-03-02,184.90,982,4,739.60,4.0,2019,3,2,425 days,1
127,Salvador,2019-03-02,240.61,1035,3,721.83,3.0,2019,3,2,425 days,1
135,Salvador,2019-03-02,9.95,1037,3,29.85,3.0,2019,3,2,425 days,1
139,Salvador,2019-03-02,169.01,1036,1,169.01,1.0,2019,3,2,425 days,1
116,Recife,2019-03-02,79.10,982,2,158.20,2.0,2019,3,2,425 days,1
133,Recife,2019-03-02,14.67,980,7,102.69,7.0,2019,3,2,425 days,1
128,Salvador,2019-03-02,36.84,1034,1,36.84,1.0,2019,3,2,425 days,1
132,Salvador,2019-03-02,19.61,1036,2,39.22,2.0,2019,3,2,425 days,1
124,Salvador,2019-03-02,44.82,1034,3,134.46,3.0,2019,3,2,425 days,1

In [ ]:
# Visualização de Dados